[
  {
    "code": "AF",
    "name": "Afganistan",
    "description": "OM’s mission in Afghanistan was established in 1992 and has maintained an uninterrupted presence in the country. IOM Afghanistan is one of the largest IOM missions worldwide, with over 290 staff and offices in Kabul, Badakhshan, Balkh, Bamyan, Herat, Kandahar, Nangarhar, Nimroz and Paktia.IOM currently implements a range of humanitarian assistance, community stabilization and migration management initiatives in Afghanistan, in cooperation with government and humanitarian partners as well as local communities."
  },
  {
    "code": "AO",
    "name": "Angola",
    "description": "No found on site"
  },
  {
    "code": "AZ",
    "name": "Azerbaijan",
    "description": "Since the inauguration of its Baku office in January 1996, IOM has been implementing a variety of projects in line with its mission to assist the Government of Azerbaijan in meeting the operational challenges of migration, advance understanding of migration issues, encourage social and economic development, and uphold the human dignity and well-being of migrants."
  },
  {
    "code": "BD",
    "name": "Bangladesh",
    "description": "IOM Dhaka is actively engaged in various areas of migration management  as well as regional policy formulation activities. As a member of the Regional Action Forum on Safe Migration, IOM Dhaka has been working with the South Asia Regional Initiative/Equity (SARI/Q) Project on various initiatives such as developing the Policy for Ensuring Safe Labour Migration within and beyond South Asia."
  },
  {
    "code": "TD",
    "name": "Chad",
    "description": "No found on site"
  },
  {
    "code": "CO",
    "name": "Colombia",
    "description": "IOM Colombia was established in 1956. In support of the Colombian government, the Organization implements programmes for migrant and vulnerable populations in nearly all departments of the country, with support from various cooperation agencies and stakeholders. Along with traditional programmes to attend to migratory flows abroad, voluntary returns, and the reintegration of Colombians returning from other countries, and strengthening the government’s capacity to address migratory issues and provide technical cooperation for migration, IOM has redesigned its activities in Colombia to the needs of populations affected by forced migration."
  },
  {
    "code": "ET",
    "name": "Ethiopia",
    "description": "No found on site"
  },
  {
    "code": "ET",
    "name": "Ethiopia",
    "description": "No found on site"
  },
  {
    "code": "HT",
    "name": "Haiti",
    "description": "IOM has been present in Haiti since 1994, when the Organization began partnering with the Government of Haiti on migration management and capacity building programmes following years of turmoil that had caused internal and international displacement, forced migration and considerable economic decline. In later years, IOM extended its cooperation to address and mitigate the effect that natural disasters have on the most vulnerable sections of the population. IOM in Haiti is committed to supporting the Government of Haiti in its immediate and long-term migration-related challenges by enhancing the capacities of national institutions to better manage their borders and regional migration dynamics, supporting public sector and civil society actors in reducing forced movement and the vulnerability of migrants, and mainstreaming migration into the development agenda through policies and legislation."
  },
  {
    "code": "IQ",
    "name": "Iraq",
    "description": "Since beginning operations in 2003, IOM Iraq has built a strong network of staff, offices and logistics, enabling the mission to respond quickly and effectively to the current displacement crisis. The more than 600 staff based in Baghdad, Erbil, Basra and numerous satellite offices are dedicated to improving the conditions of the displaced. With a presence on the ground in all governorates, IOM staff have been on the front lines of the humanitarian response to this unprecedented crisis in Iraq. IOM Iraq provides a range of emergency response services: non-food item kits, shelter, livelihoods assistance, primary health care, and psychosocial assistance to help displaced persons regain dignity in their lives. IOM Iraq also provides technical cooperation including government capacity building on migration issues."
  },
  {
    "code": "LY",
    "name": "Libya",
    "description": "No found on site"
  },
  {
    "code": "MG",
    "name": "Madagascar",
    "description": "Since 2014, IOM has supported the Government of Madagascar in addressing the challenges and advancing the benefits of migration. Over the years, IOM Madagascar has implemented programmes concerning health and migration, international migration law, migration and the environment, counter-trafficking, forced migration and displacement linked to natural disasters, labour migration, and diaspora engagement, channeled through consultation services and technical cooperation."
  },
  {
    "code": "ML",
    "name": "Mali",
    "description": "The IOM mission in Mali was established in 1998. Since then, IOM has worked hand in hand with the Government of Mali to meet the needs of the most vulnerable and help tackle the migration challenges such as forced migration, irregular migration, trafficking in persons, and smuggling of migrants, among others."
  },
  {
    "code": "MZ",
    "name": "Mozambique",
    "description": "Mobility is an integral part of life in Mozambique. Mozambique is a large country with more than 53 border posts, significant transport corridors linking landlocked countries – such as Zimbabwe, Zambia and Malawi – to major sea ports and to the regional hub of South Africa. These transport corridors are home to mobile and migrant groups including cross border traders and long distance transporters. Historically, labour migrants work in South African mines and commercial farms. More recently, internal labour migration is on the increase as the economy opens up to extractives and energy companies. With the economy in Mozambique rapidly improving, it is beginning to experience increased migration flows into the country, particularly in the centre and north – as entry points for transit through Mozambique to South Africa, and as migrants enter to seek work with extractives companies."
  },
  {
    "code": "MM",
    "name": "Myanmar",
    "description": "Migration within Myanmar and across its long borders, which cover Thailand, Laos, China, India and Bangladesh, is subject to a range of drivers which are complex and are critical in affecting how and why people decide to move."
  },
  {
    "code": "NP",
    "name": "Nepal",
    "description": "Nepal became an IOM member state in 2006. In 2007, the Government of Nepal (GoN) and IOM signed a memorandum of understanding to encourage cooperation and the delivery of services to Nepal, which is a country of origin, transit and destination in terms of migration. IOM’s initial focus was on refugee resettlement.  Since then, with its staff of 406 (382 national and 24 international, as of November 2013), IOM has diversified its areas of cooperation with the GoN into various fields."
  },
  {
    "code": "NG",
    "name": "Nigeria",
    "description": "Since 2002, based on a Cooperation Agreement, IOM has been supporting the efforts of the Government of Nigeria to manage migration through capacity-building, advisory services, and technical assistance on migration matters, including migration health and information, assisted voluntary returns, and counter-trafficking. Strong collaboration has been established with national migration stakeholders in order to enhance border management, fight trafficking in persons, reduce irregular migration, and mainstream migration in the country’s development plans. In 2011 and beyond, IOM plans to provide further support to the Nigerian Government within the above mentioned programme areas."
  },
  {
    "code": "PK",
    "name": "Pakistan",
    "description": "IOM initiated its work in Pakistan in 1981 following a government request for assistance with the influx of Afghans into the country. The organization has since expanded its programmes to support a broad range of activities from humanitarian response to migration management. Pakistan signed as a Member State of IOM in 1992 and established a Cooperation Agreement with IOM in October 2000. As an active participant in the Delivering as One UN Programme in Pakistan since its inception in 2009, IOM co-leads the strategic priority area for “Increased National Resilience to Disasters, Crises and External Shocks.”"
  },
  {
    "code": "PA",
    "name": "Panama",
    "description": "Historically, Panama has been a country of destination and transit for migrants but also has become an origin of migrants in a lower scale. Its strategic location and the ambitious projects being implemented by the Government attract a large number of migrants. In the recent years Panama has been facing an economic growth rate without precedents. The expansion of the Canal, the real estate boom and the investments made by important companies, which have selected this as their central operations hub, have positioned Panama as a very attractive country. The economic growth has become a pull factor for the increased migration inflows. The Government of Panama has recently approved the new migration law, updating the last one which dated from 1960. The migration subject is one of the top priorities in the agenda."
  },
  {
    "code": "PE",
    "name": "Peru",
    "description": "Peru has been an IOM Member State of the International Organization for Migration (IOM) since 1966. The Peruvian Government formally accepted the Constitution of IOM by Decree Law No. 17559, dated April 1, 1969. Since then, IOM has provided technical assistance and advice to the Peruvian Government, other public entities and civil society organizations on migration management, promotion of human rights of migrants, emergency response to natural disasters, among others."
  },
  {
    "code": "RW",
    "name": "Rwanda",
    "description": "No found on site"
  },
  {
    "code": "RS",
    "name": "Serbia",
    "description": "No found on site"
  },
  {
    "code": "SO",
    "name": "Somalia",
    "description": "No found on site"
  },
  {
    "code": "SS",
    "name": "South Sudan",
    "description": "Present in Southern Sudan since 2004, the International Organization for Migration (IOM) has 8 offices across 6 states and employs over 340 staff. IOM currently implements a range of humanitarian assistance, transition and recovery, border management and migration health initiatives in South Sudan, in cooperation with government and humanitarian partners as well as local communities. South Sudan became a member state of IOM in 2011."
  },
  {
    "code": "LK",
    "name": "Sri Lanka",
    "description": "No found on site"
  },
  {
    "code": "SD",
    "name": "Sudan",
    "description": "IOM Sudan opened an office in Khartoum in 2000. At this time activities initially focused on resettlement of refugees to various receiving countries in collaboration with UNHCR. In 2002, IOM Sudan expanded its activities to include direct assistance to Internally Displaced Persons (IDPs) during displacement and in preparation for their return and reintegration. Since 2004 IOM’s activities have expanded to include work on the tracking and monitoring of displaced persons and returnees, including assessments and reintegration and community stabilization assistance in areas of high return; assistance to other stranded Sudanese migrants abroad; and specific assistance for the return and reintegration of highly qualified Sudanese to contribute to the development of their country. Additionally, IOM has expanded its services within the area of migration information, research, data collection and assisting in the development of national capacities in migration management, in both regional and international context."
  },
  {
    "code": "UA",
    "name": "Ukraine",
    "description": "IOM Ukraine aims at advancing the understanding of the opportunities and challenges of migration in the Ukrainian context. Maximizing those opportunities and minimizing the challenges presented by migratory movements are the guiding principles of all activities and programmes the Mission is engaged in. The IOM Mission in Ukraine provides assistance to internally displaced persons (IDPs) and conflict-affected people, fights trafficking in human beings, assists the Government in dealing with irregular migration, improving its migration management system, and creating migrant-inclusive health practices and policies. At the same time, IOM Ukraine engages in harnessing the development potential of migration, disseminating migration information, supporting integration of migrants, promoting the benefits of cultural diversity, and counteracting xenophobia and intolerance. During 20 years of presence in Ukraine, IOM has assisted about half a million migrants (Ukrainians and other nationalities), IDPs, potential migrants, victims of trafficking and other vulnerable groups, directly or through its project partners."
  },
  {
    "code": "TZ",
    "name": "United Republic of Tanzania",
    "description": "Tanzania is designated as one of the eight pilot countries for the United Nations’ “Delivering as One” reform program. IOM operates within the United Nations Development Assistance Plan (UNDAP), a single plan for all UN funds, programmes and agencies in Tanzania.<br/><br/>The United Republic of Tanzania’s location on Africa’s east coast and its political stability relative to its neighbours has always exposed it to a variety of migration flows – as a country of origin, transit and destination. Border movement is significant, with eight neighbouring countries to the north, west and south and a long coastline to the east with several natural harbours. Migration to, within and from the country produces a complex and ever changing picture. The trend has been dominated by large movements of migrants from rural to urban areas, large movement of refugees to Northwest Tanzania from neighbouring countries, international labour migration and irregular migration."
  },
  {
    "code": "YE",
    "name": "Yemen",
    "description": "IOM started operating in Yemen in 1994 when the organization assisted in evacuating migrants from Aden stranded during the civil war. The government of Yemen has been a member state of IOM since 1999 and a first status agreement with the government was signed in 2001. IOM has worked closely with the Ministry of Expatriate Affairs on Yemeni migrant communities abroad and/or returning to Yemen; it continues providing transportation assistance to migrants stranded in Yemen and victims of trafficking in conjunction with Immigration authorities. In 2006, counter trafficking technical assistance was provided in Haradh in coordination with UNICEF to build the capacity of shelters for Yemeni minors. In 2007, an IOM Office was established in Sana’a to work more closely in assisting stranded migrants.  The 2001 status agreement was further ratified by the Ministry of Foreign Affairs (MoFA) in 2013. In addition to the mission in Sana’a, two IOM sub IOM-offices operate in Aden and Hodeidah (the latter was moved from Haradh in 2015 because of the conflict). There are three IOM Migrant Response Points - in Aden, Bab Al Mandeb, and Hodeidah - to address the immediate needs of vulnerable migrants. IOM field teams operate and have local presence in 15 governorates."
  },
  {
    "code": "ZW",
    "name": "Zimbabwe",
    "description": "Zimbabwe’s economic crisis precipitated an exodus of professionals and skilled workers emigrating in search of better economic opportunities. The flow of migrants from Zimbabwe into neighbouring countries in an irregular fashion continues unabated, and migratory flows from, to, and within Zimbabwe have presented a myriad of challenges to the country’s migration management capacity.The humanitarian situation in the country has been exacerbated by the crisis following the June 2008 presidential elections, as well as the on-going constitutional referendum process and build-up to a general election. In response, IOM Zimbabwe is implementing various projects to support migration-affected communities to manage the resulting migration challenges. IOM operates in all 10 provinces through partnerships with over 25 implementing partners and a staff of 134, including 15 international staff. IOM Zimbabwe has enhanced its cooperation and partnership with the Government of Zimbabwe both at national and local levels throughout the country. These good relationships have contributed significantly to providing assistance in a timely and effective manner."
  }
]