[
  {
    "code": "1",
    "name": "Movement, Emergency and Post-Crisis Migration Management",
    "description": "These activities, which are the responsibility of the Department of Operations and Emergencies, provide secure, reliable, flexible and cost-effective services to migrants during emergency and post-crisis situations, and ensure that the human rights and well-being of migrants are guaranteed in accordance with international law."
  },
  {
    "code": "16050",
    "name": "Multisector aid for basic social services",
    "description": "No description"
  },
  {
    "code": "CS",
    "name": "Community Stabilization",
    "description": "These projects assist governments and mobile and vulnerable populations to recover from the effects of natural disasters, environmental degradation, gross human rights violations, instability and war."
  },
  {
    "code": "72010",
    "name": "Material relief assistance and services",
    "description": "No description"
  },
  {
    "code": "DP",
    "name": "Internally Displaced Persons",
    "description": "These projects provide assistance to, protecting and improving the lives of displaced persons (IDSs and refugees) returnees, host and return communities and significantly contributing towards development stability within regions. "
  },
  {
    "code": "RA",
    "name": "Repatriation Assistance",
    "description": "These projects provide voluntary repatriation assistance to refugees, mainly in support of UNHCR repatriation activities in accordance with protection concerns and procedures, which take into account the specific status of returnees.  Project activities include comprehensive repatriation assistance to ensure the safe and sustainable return of refugees to their countries of origin; transport arrangements made for the beneficiaries are sometimes supplemented with reintegration assistance. "
  },
  {
    "code": "93010",
    "name": "Refugees in donor countries (non-sector allocable)",
    "description": "No description"
  },
  {
    "code": "RE",
    "name": "Resettlement Assistance",
    "description": "These projects provide a wide range of support (case processing, migration bealth assessments, migrant training and transportation) to Governments and UNHCR in implementing refugee resettlement programs offering resettlement as a durable solution to individual needs for international protection.  Activities assist resettled people accepted under regular immigration programmes by; processing the relevant documents, providing health assessments and arranging safe, reliable and economical transportation. "
  },
  {
    "code": "MP",
    "name": "Migr Health Assist for Crisis Aff Pops",
    "description": "These projects help governments and populations in emergency preparedness, during and in the aftermath of emergencies by managing health and psychosocial issues related tot eh displacement and mass movement of people and arranging travel health assistance, referrals and medical evacuations for individuals who cannot be cared for locally because health facilities are overstretched or have been destroyed.  Projects also include the reconstruction of damaged health infrastructures to ensure access to life-saving and basic primary health services."
  },
  {
    "code": "2",
    "name": "Migration Health",
    "description": "Within its Migration Health Division (MHD), IOM delivers and promotes comprehensive, preventive and curative health programmes which are beneficial, accessible, and equitable for migrants and mobile populations. Bridging the needs of both migrants and IOM member states, MHD, in close collaboration with partners, contributes towards the physical, mental and social well-being of migrants, enabling them and host communities to achieve social and economic development."
  },
  {
    "code": "73010",
    "name": "Reconstruction relief and rehabilitation",
    "description": "No description"
  },
  {
    "code": "DS",
    "name": "Durable Solutions",
    "description": "No description"
  },
  {
    "code": "72050",
    "name": "Relief co-ordination; protection and support services",
    "description": "No description"
  },
  {
    "code": "CC",
    "name": "Camp Coordination and Camp Management",
    "description": "No description"
  },
  {
    "code": "DX",
    "name": "Displacement Tracking",
    "description": "No description"
  },
  {
    "code": "SN",
    "name": "Emergency Shelter and NFI",
    "description": "No description"
  },
  {
    "code": "PB",
    "name": "Peacebuilding and Peace Preservation",
    "description": "No description"
  },
  {
    "code": "15220",
    "name": "Civilian peace-building, conflict prevention and resolution",
    "description": "No description"
  },
  {
    "code": "DR",
    "name": "Disaster Risk Reduction",
    "description": "No description"
  },
  {
    "code": "74010",
    "name": "Disaster prevention and preparedness",
    "description": "No description"
  }
]